# =============================================================================
# ЛАБОРАТОРНАЯ РАБОТА 3
# Задача кластеризации: Сегментация клиентов банка
# =============================================================================

# ЭТАП 1: ПОСТАНОВКА ЗАДАЧИ И ДАННЫЕ

import warnings
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from IPython.display import display

warnings.filterwarnings("ignore")

# Настройки визуализации
PALETTE = "Set2"
sns.set(style="whitegrid")
plt.rcParams["figure.figsize"] = (12, 6)
plt.rcParams["font.size"] = 12

RANDOM_STATE = 42

print("=" * 70)
print("ЛАБОРАТОРНАЯ РАБОТА 3: КЛАСТЕРИЗАЦИЯ КЛИЕНТОВ БАНКА")
print("=" * 70)

print("\n--- ЭТАП 1: ПОСТАНОВКА ЗАДАЧИ И ДАННЫЕ ---\n")

print("ОПИСАНИЕ ЗАДАЧИ:")
print("-" * 50)
print("""
Тип задачи: КЛАСТЕРИЗАЦИЯ (обучение без учителя)

Цель: Сегментация клиентов банка на основе их характеристик
для оптимизации маркетинговых кампаний.

Бизнес-задача:
- Выявить группы клиентов со схожими характеристиками
- Понять, какие сегменты наиболее перспективны для маркетинга
- Персонализировать предложения для каждого сегмента
""")

print("=" * 60)
print("ОБОСНОВАНИЕ ВЫБОРА КЛАСТЕРИЗАЦИИ (а не регрессии/рекомендаций)")
print("=" * 60)
print("""
В ЛР3 предлагалось выбрать одну из трёх задач:
  1) Регрессия
  2) Кластеризация
  3) Рекомендательная система

МЫ ВЫБРАЛИ КЛАСТЕРИЗАЦИЮ по следующим причинам:

ПОЧЕМУ НЕ РЕГРЕССИЯ?
  • В нашем датасете НЕТ непрерывной целевой переменной для
    предсказания (y - бинарная: yes/no)
  • Можно было бы предсказывать duration (длительность звонка),
    но это не имеет бизнес-смысла - она известна только ПОСЛЕ звонка
  • Экономические индикаторы одинаковы для всех клиентов в момент
    времени - их предсказывать нелогично

ПОЧЕМУ НЕ РЕКОМЕНДАТЕЛЬНАЯ СИСТЕМА?
  • Нет данных о взаимодействиях пользователь-товар (user-item)
  • Нет рейтингов или истории покупок
  • Датасет описывает характеристики клиентов, а не их предпочтения
  • Структура данных не подходит для collaborative filtering

ПОЧЕМУ КЛАСТЕРИЗАЦИЯ - ЛУЧШИЙ ВЫБОР?
  ✓ Датасет содержит разнообразные характеристики клиентов
    (демографические, финансовые, поведенческие)
  ✓ Кластеризация позволит найти естественные группы клиентов
  ✓ Не требуется размеченных данных (обучение без учителя)
  ✓ Результаты имеют прямую бизнес-ценность:
    - Сегментация для таргетированного маркетинга
    - Персонализация предложений для каждой группы
    - Оптимизация ресурсов на маркетинговые кампании
  ✓ Логически дополняет ЛР1 (EDA) и ЛР2 (классификация)
""")

# Загрузка данных
print("\nЗагрузка данных...")
try:
    url = "https://drive.google.com/uc?id=1dvVgFSH22J7okTKYD8sHzJvJJ9MRZzkN&export=download"
    df = pd.read_csv(url, delimiter=";")
    print("✓ Файл успешно загружен")
except Exception as e:
    print(f"✗ Ошибка загрузки файла: {e}")
    exit(1)

# Словарь для перевода названий столбцов
COLUMN_TRANSLATOR = {
    "age": "Возраст",
    "job": "Профессия",
    "marital": "Семейное положение",
    "education": "Образование",
    "default": "Кредитный дефолт",
    "housing": "Ипотека",
    "loan": "Потребительский кредит",
    "contact": "Тип контакта",
    "month": "Месяц",
    "day_of_week": "День недели",
    "duration": "Длительность звонка (сек)",
    "campaign": "Кол-во контактов в кампании",
    "pdays": "Дней с прошлого контакта",
    "previous": "Кол-во прошлых контактов",
    "poutcome": "Результат прошлой кампании",
    "emp.var.rate": "Изм. уровня занятости",
    "cons.price.idx": "Индекс потреб. цен",
    "cons.conf.idx": "Индекс потреб. доверия",
    "euribor3m": "Ставка Euribor 3M",
    "nr.employed": "Число занятых",
    "y": "Согласие на вклад",
}

print("\nОПИСАНИЕ ДАТАСЕТА:")
print("-" * 50)
print(f"Размерность: {df.shape[0]} строк × {df.shape[1]} столбцов")

print("\nПервые 5 строк датасета:")
display(df.head())

print("\nИнформация о типах данных:")
df.info()

# Предобработка данных для кластеризации
print("\n--- Предобработка данных для кластеризации ---")

# Удаление дубликатов
df.drop_duplicates(inplace=True)
print(f"✓ Дубликаты удалены. Размерность: {df.shape}")

# Обработка 'unknown' значений
object_cols = df.select_dtypes(include=["object"]).columns
for col in object_cols:
    if "unknown" in df[col].unique():
        mode_value = df[col].mode()[0]
        if mode_value == "unknown":
            second_mode = df[col].value_counts().index[1]
            df[col] = df[col].replace("unknown", second_mode)
        else:
            df[col] = df[col].replace("unknown", mode_value)
print("✓ Значения 'unknown' заменены на моду")

# Для кластеризации будем использовать только релевантные признаки клиента
clustering_features = [
    "age", "job", "marital", "education", "default",
    "housing", "loan", "campaign", "pdays", "previous", "poutcome",
]

df_cluster = df[clustering_features].copy()
print(f"\n✓ Выбраны признаки для кластеризации: {len(clustering_features)} шт.")
print(f"  {clustering_features}")


# ЭТАП 2: БАЗОВЫЙ МЕТОД (BASELINE) - K-MEANS

from sklearn.cluster import KMeans
from sklearn.metrics import (
    calinski_harabasz_score,
    davies_bouldin_score,
    silhouette_score,
    adjusted_rand_score,
)
from sklearn.preprocessing import LabelEncoder, StandardScaler

print("\n" + "=" * 70)
print("ЭТАП 2: БАЗОВЫЙ МЕТОД (BASELINE) - K-MEANS КЛАСТЕРИЗАЦИЯ")
print("=" * 70)

# Подготовка данных: кодирование категориальных признаков
print("\n--- Подготовка данных ---")

df_encoded = df_cluster.copy()

# Label Encoding для категориальных признаков
label_encoders = {}
categorical_cols = df_encoded.select_dtypes(include=["object"]).columns

for col in categorical_cols:
    le = LabelEncoder()
    df_encoded[col] = le.fit_transform(df_encoded[col])
    label_encoders[col] = le
    print(f"✓ {col}: закодировано {len(le.classes_)} категорий")

# Масштабирование
scaler = StandardScaler()
X_scaled = scaler.fit_transform(df_encoded)
print("\n✓ Данные стандартизированы (StandardScaler)")

# Метод локтя для определения оптимального количества кластеров
print("\n--- Метод локтя (Elbow Method) ---")

inertias = []
silhouettes = []
K_range = range(2, 11)

for k in K_range:
    kmeans = KMeans(n_clusters=k, random_state=RANDOM_STATE, n_init=10)
    kmeans.fit(X_scaled)
    inertias.append(kmeans.inertia_)
    silhouettes.append(silhouette_score(X_scaled, kmeans.labels_))
    print(f"k={k}: Inertia={kmeans.inertia_:.2f}, Silhouette={silhouettes[-1]:.4f}")

# Визуализация метода локтя
fig, axes = plt.subplots(1, 2, figsize=(14, 5))

axes[0].plot(K_range, inertias, "bo-", linewidth=2, markersize=8)
axes[0].set_xlabel("Количество кластеров (k)")
axes[0].set_ylabel("Инерция (Inertia)")
axes[0].set_title("Метод локтя: Инерция vs Количество кластеров")
axes[0].grid(True, alpha=0.3)

axes[1].plot(K_range, silhouettes, "go-", linewidth=2, markersize=8)
axes[1].set_xlabel("Количество кластеров (k)")
axes[1].set_ylabel("Silhouette Score")
axes[1].set_title("Silhouette Score vs Количество кластеров")
axes[1].grid(True, alpha=0.3)

plt.tight_layout()
plt.savefig("elbow_method.png", dpi=150, bbox_inches="tight")
plt.show()

print("\n📊 [СКРИНШОТ 1: Метод локтя - elbow_method.png]")

# Выбираем оптимальное k
optimal_k = 4
print(f"\n✓ Оптимальное количество кластеров: k = {optimal_k}")

# Обучение финальной модели KMeans (BASELINE)
print("\n--- Обучение KMeans (BASELINE) с k={} ---".format(optimal_k))

kmeans_final = KMeans(n_clusters=optimal_k, random_state=RANDOM_STATE, n_init=10)
kmeans_labels = kmeans_final.fit_predict(X_scaled)

df["cluster_kmeans"] = kmeans_labels

# Метрики для baseline
baseline_silhouette = silhouette_score(X_scaled, kmeans_labels)
baseline_inertia = kmeans_final.inertia_
baseline_davies_bouldin = davies_bouldin_score(X_scaled, kmeans_labels)
baseline_calinski = calinski_harabasz_score(X_scaled, kmeans_labels)

print(f"✓ KMeans (BASELINE) обучен")
print(f"\nМетрики BASELINE (KMeans):")
print(f"  • Silhouette Score: {baseline_silhouette:.4f}")
print(f"  • Inertia: {baseline_inertia:.2f}")
print(f"  • Davies-Bouldin Index: {baseline_davies_bouldin:.4f}")
print(f"  • Calinski-Harabasz Index: {baseline_calinski:.2f}")

print(f"\nРаспределение по кластерам:")
print(pd.Series(kmeans_labels).value_counts().sort_index())

